## NYC VEHICLE COLLISION ANALYSIS

### Q1_PART TWO
* Use ‘vehicle_collisions’ data set.
* For each borough, find out distribution of each collision scale. (One car involved? Two? Three? or more?) (From 2015 to present)
* Display a few rows of the output use df.head().
* Generate a csv output with five columns ('borough', 'one-vehicle', 'two- vehicles', 'three-vehicles', 'more-vehicles')

In [99]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np
import csv

In [149]:
car = pd.read_csv('Data/vehicle_collisions.csv')

In [150]:
car.head()

,UNIQUE KEY,DATE,TIME,BOROUGH,ZIP CODE,LATITUDE,LONGITUDE,LOCATION,ON STREET NAME,CROSS STREET NAME,...,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE 5 TYPE,VEHICLE 1 FACTOR,VEHICLE 2 FACTOR,VEHICLE 3 FACTOR,VEHICLE 4 FACTOR,VEHICLE 5 FACTOR
0,3146911,1/1/15,0:20,QUEENS,11358.0,40.751847,-73.787862,"(40.7518471, -73.787862)",47 AVENUE,193 STREET,...,SPORT UTILITY/STATION WAGON,NaN,NaN,NaN,NaN,TRAFFIC CONTROL DISREGARDED,NaN,NaN,NaN,NaN
1,3146180,1/1/15,0:20,NaN,NaN,40.771289,-73.946693,"(40.7712888, -73.9466928)",NaN,NaN,...,PASSENGER VEHICLE,NaN,NaN,NaN,NaN,ANIMALS ACTION,NaN,NaN,NaN,NaN
2,3146384,1/1/15,0:21,BROOKLYN,11205.0,40.689445,-73.955121,"(40.6894449, -73.9551212)",BEDFORD AVENUE,LAFAYETTE AVENUE,...,PASSENGER VEHICLE,UNKNOWN,NaN,NaN,NaN,FATIGUED/DROWSY,UNSPECIFIED,NaN,NaN,NaN
3,3146013,1/1/15,0:30,BROOKLYN,11213.0,40.673845,-73.925080,"(40.6738445, -73.9250801)",BUFFALO AVENUE,SAINT MARKS AVENUE,...,BUS,PASSENGER VEHICLE,NaN,NaN,NaN,LOST CONSCIOUSNESS,NaN,NaN,NaN,NaN
4,3146120,1/1/15,0:33,NaN,NaN,NaN,NaN,NaN,RICHMOND TERRACE,SOUTH AVENUE,...,UNKNOWN,PASSENGER VEHICLE,NaN,NaN,NaN,UNSPECIFIED,UNSPECIFIED,NaN,NaN,NaN

In [270]:
car.BOROUGH.value_counts()

BROOKLYN         104961
QUEENS            89655
MANHATTAN         83602
BRONX             46124
STATEN ISLAND     14048
Name: BOROUGH, dtype: int64

In [176]:
# calculate the count of Vehicle2
car['VEHICLE 2 Count']= car[['VEHICLE 2 TYPE']].apply(lambda x: 1 if(np.all(pd.notnull(x))) else 0, axis = 1)

In [178]:
# calculate the count of Vehicle3
car['VEHICLE 3 Count']= car[['VEHICLE 3 TYPE']].apply(lambda x: 1 if(np.all(pd.notnull(x))) else 0, axis = 1)

In [183]:
# calculate the count of Vehicle4
car['VEHICLE 4 Count']= car[['VEHICLE 4 TYPE']].apply(lambda x: 1 if(np.all(pd.notnull(x))) else 0, axis = 1)

In [184]:
# calculate the count of Vehicle5
car['VEHICLE 5 Count']= car[['VEHICLE 5 TYPE']].apply(lambda x: 1 if(np.all(pd.notnull(x))) else 0, axis = 1)

In [185]:
# calculate the count of Vehicle1
car['VEHICLE 6 Count']= car[['VEHICLE 1 TYPE']].apply(lambda x: 1 if(np.all(pd.notnull(x))) else 0, axis = 1)

In [187]:
# get all the number of count and add a new column named Total count
car['Total Count'] = car['VEHICLE 2 Count']+car['VEHICLE 3 Count']+car['VEHICLE 4 Count']+car['VEHICLE 5 Count']+car['VEHICLE 6 Count']

In [293]:
#define a function to get the distribution for each area
def getBOROUGH(name):
    # pass the different BOROUGH values 
    one = car[car.BOROUGH==name]
    # Get the total count series of the involved cars
    s = one['Total Count'].value_counts().sort_index()
    # calculate the 'more-vehicles' that more than three
    s[4]= s[4] + s[5]
    newS = s.drop([0,5])
    return newS

In [294]:
#Concatenating Along an Axis
output = pd.concat([getBOROUGH('BROOKLYN'), getBOROUGH('QUEENS'),getBOROUGH('MANHATTAN'),getBOROUGH('BRONX'),getBOROUGH('STATEN ISLAND')], axis=1).T

In [295]:
output

                 1      2     3     4
Total Count  17375  80207  4980  1612
Total Count  12962  70260  4498  1420
Total Count  13318  66958  2024   501
Total Count   8627  34385  1962   625
Total Count   2343  10676   759   165

In [296]:
car.BOROUGH.value_counts().index

Index(['BROOKLYN', 'QUEENS', 'MANHATTAN', 'BRONX', 'STATEN ISLAND'], dtype='object')

In [300]:
# add the index name
output1 = output.set_index(car.BOROUGH.value_counts().index)

In [307]:
# add the colums name
output1.columns=['ONE_VEHICLE_INVOLVED', 'TWO_VEHICLES_INVOLVED', 'THREE_VEHICLES_INVOLVED','MORE_VEHICLES_INVOLVED']

In [318]:
output1.columns.name='BOROUGH'

In [320]:
# Write DataFrame to CSV 
output1.to_csv('Q1_PART TWO.csv')

In [321]:
output2 = pd.read_csv('Q1_PART TWO.csv')

In [323]:
output2

,Unnamed: 0,ONE_VEHICLE_INVOLVED,TWO_VEHICLES_INVOLVED,THREE_VEHICLES_INVOLVED,MORE_VEHICLES_INVOLVED
0,BROOKLYN,17375,80207,4980,1612
1,QUEENS,12962,70260,4498,1420
2,MANHATTAN,13318,66958,2024,501
3,BRONX,8627,34385,1962,625
4,STATEN ISLAND,2343,10676,759,165